MB3hel/Arduino-Core-MSP430/cores/msp430/wiring_analog.cpp
#if defined(__MSP430_HAS_ADC10__)
    // -----------------------------------------------------------------------------------------------------------------
    // F2xx and G2xx family ADC10 module
    // -----------------------------------------------------------------------------------------------------------------
#ifndef ADC10ENC
#define ADC10ENC ENC
#endif
    ADC10CTL0 |= ADC10ON;                       // Turn ADC on
    ADC10CTL1 &= ~INCH_15;                      // Clear channel selection
    ADC10CTL1 |= 
        ((PxADCCH(pinNumber) & 0xF) << 12);     // Select channel
    ADC10CTL0 |= ADC10ENC | ADC10SC;            // Enable & start conversion
    __bis_SR_register(LPM0_bits + GIE);         // Enter low power mode (will be woken by ISR)
    ADC10CTL0 &= ~(ADC10ENC | ADC10SC);         // Disable conversion
    ADC10CTL0 &= ~ADC10ON;                      // Turn ADC off
    return (int)ADC10MEM;
    // -----------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC12__)
    // -----------------------------------------------------------------------------------------------------------------
    // F2xx and G2xx family ADC12 module
    // -----------------------------------------------------------------------------------------------------------------
#ifndef ADC12ENC
#define ADC12ENC ENC
#endif
    ADC12CTL0 |= ADC12ON;                       // Turn ADC on
    ADC12MCTL0 &= ~INCH_15;                     // Clear channel selection
    ADC12MCTL0 |= 
        ((PxADCCH(pinNumber) & 0xF) << 0);      // Select channel
    ADC12CTL0 |= ADC12ENC | ADC12SC;            // Enable & start conversion
    __bis_SR_register(LPM0_bits + GIE);         // Enter low power mode (will be woken by ISR)
    ADC12CTL0 &= ~(ADC12ENC | ADC12SC);         // Disable conversion
    ADC12CTL0 &= ~ADC12ON;                      // Turn ADC off
    return (int)ADC12MEM0;
    // -----------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC10_B__)
    // -----------------------------------------------------------------------------------------------------------------
    // FR57xx family ADC10_B module
    // -----------------------------------------------------------------------------------------------------------------
    ADC10CTL0 |= ADC10ON;                       // Turn ADC on
    ADC10MCTL0 &= ~ADC10INCH_15;                // Clear channel selection
    ADC10MCTL0 |= 
        ((PxADCCH(pinNumber) & 0xF) << 0);      // Select channel
    ADC10CTL0 |= ADC10ENC | ADC10SC;            // Enable & start conversion
    __bis_SR_register(LPM0_bits + GIE);         // Enter low power mode (will be woken by ISR)
    ADC10CTL0 &= ~(ADC10ENC | ADC10SC);         // Disable conversion
    ADC10CTL0 &= ~ADC10ON;                      // Turn ADC off
    return (int)ADC10MEM0;
    // -----------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC12_B__)
    // -----------------------------------------------------------------------------------------------------------------
    // FR58xx, FR59xx, FR6xx family ADC12_B module
    // -----------------------------------------------------------------------------------------------------------------
    ADC12CTL0 |= ADC12ON;                       // Turn ADC on
    ADC12MCTL0 &= ~ADC12INCH_15;                // Clear channel selection
    ADC12MCTL0 |= 
        ((PxADCCH(pinNumber) & 0xF) << 0);      // Select channel
    ADC12CTL0 |= ADC12ENC | ADC12SC;            // Enable & start conversion
    __bis_SR_register(LPM0_bits + GIE);         // Enter low power mode (will be woken by ISR)
    ADC12CTL0 &= ~(ADC12ENC | ADC12SC);         // Disable conversion
    ADC12CTL0 &= ~ADC12ON;                      // Turn ADC off
    return (int)ADC12MEM0;
    // -----------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC__)
    // -----------------------------------------------------------------------------------------------------------------
    // FR4xx and FR2xx family ADC (multi resolution)
    // -----------------------------------------------------------------------------------------------------------------
    ADCCTL0 |= ADCON;                           // Turn ADC on
    ADCMCTL0 &= ~ADCINCH_15;                    // Clear channel selection
    ADCMCTL0 |= 
        ((PxADCCH(pinNumber) & 0xF) << 0);      // Select channel
    ADCCTL0 |= ADCENC | ADCSC;                  // Enable & start conversion
    __bis_SR_register(LPM0_bits + GIE);         // Enter low power mode (will be woken by ISR)
    ADCCTL0 &= ~(ADCENC | ADCSC);               // Disable conversion
    ADCCTL0 &= ~ADCON;                          // Turn ADC off
    return (int)ADCMEM0;
    // -----------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC12_PLUS__)
    // -----------------------------------------------------------------------------------------------------------------
    // x5xx and x6xx family ADC12_A module
    // -----------------------------------------------------------------------------------------------------------------
    ADC12CTL0 |= ADC12ON;                       // Turn ADC on
    ADC12MCTL0 &= ~ADC12INCH_15;                // Clear channel selection
    ADC12MCTL0 |= 
        ((PxADCCH(pinNumber) & 0xF) << 0);      // Select channel
    ADC12CTL0 |= ADC12ENC | ADC12SC;            // Enable & start conversion
    __bis_SR_register(LPM0_bits + GIE);         // Enter low power mode (will be woken by ISR)
    ADC12CTL0 &= ~(ADC12ENC | ADC12SC);         // Disable conversion
    ADC12CTL0 &= ~ADC12ON;                      // Turn ADC off
    return (int)ADC12MEM0;
    // -----------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC10_A__)
    // -----------------------------------------------------------------------------------------------------------------
    // x5xx and x6xx family ADC10_A module
    // -----------------------------------------------------------------------------------------------------------------
    ADC10CTL0 |= ADC10ON;                       // Turn ADC on
    ADC10MCTL0 &= ~ADC10INCH_15;                // Clear channel selection
    ADC10MCTL0 |= 
        ((PxADCCH(pinNumber) & 0xF) << 0);      // Select channel
    ADC10CTL0 |= ADC10ENC | ADC10SC;            // Enable & start conversion
    __bis_SR_register(LPM0_bits + GIE);         // Enter low power mode (will be woken by ISR)
    ADC10CTL0 &= ~(ADC10ENC | ADC10SC);         // Disable conversion
    ADC10CTL0 &= ~ADC10ON;                      // Turn ADC off
    return (int)ADC10MEM0;
    // -----------------------------------------------------------------------------------------------------------------
#else
    return 0;                                   // No known ADC
#endif
}

// ADC ISRs
#if defined(__MSP430_HAS_ADC10__)
// ---------------------------------------------------------------------------------------------------------------------
// F2xx and G2xx family ADC10 module
// ---------------------------------------------------------------------------------------------------------------------
__interrupt_vec(ADC10_VECTOR) void ADC10_ISR(){
    __bic_SR_register_on_exit(LPM0_bits);       // Exit LPM0
    ADC10CTL0 &= ~ADC10IFG;                     // Clear interrupt flags
}
// ---------------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC12__)
// ---------------------------------------------------------------------------------------------------------------------
// F2xx and G2xx family ADC12 module
// ---------------------------------------------------------------------------------------------------------------------
__interrupt_vec(ADC12_VECTOR) void ADC10_ISR(){
    if(ADC12IV & ADC12IV_ADC12IFG0)
        __bic_SR_register_on_exit(LPM0_bits);   // Exit LPM0
    ADC12IFG = 0;                               // Clear interrupt flags
}
// ---------------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC10_B__)
// ---------------------------------------------------------------------------------------------------------------------
// FR57xx family ADC10_B module
// ---------------------------------------------------------------------------------------------------------------------
__interrupt_vec(ADC10_VECTOR) void ADC10_ISR(){
    if(ADC10IV & ADC10IV_ADC10IFG)
        __bic_SR_register_on_exit(LPM0_bits);   // Exit LPM0
    ADC10IFG = 0;                               // Clear interrupt flags
}
// ---------------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC12_B__)
// ---------------------------------------------------------------------------------------------------------------------
// FR58xx, FR59xx, FR6xx family ADC12_B module
// ---------------------------------------------------------------------------------------------------------------------
// TODO
// ---------------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC__)
// ---------------------------------------------------------------------------------------------------------------------
// FR4xx and FR2xx family ADC (multi resolution)
// ---------------------------------------------------------------------------------------------------------------------
// TODO
// ---------------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC12_PLUS__)
// ---------------------------------------------------------------------------------------------------------------------
// x5xx and x6xx family ADC12_A module
// ---------------------------------------------------------------------------------------------------------------------
// TODO
// ---------------------------------------------------------------------------------------------------------------------
#elif defined(__MSP430_HAS_ADC10_A__)
// ---------------------------------------------------------------------------------------------------------------------
// x5xx and x6xx family ADC10_A module
// ---------------------------------------------------------------------------------------------------------------------
// TODO
// ---------------------------------------------------------------------------------------------------------------------
#endif

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// PWM
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

void analogWrite(pin_size_t pinNumber, int value){
    // TODO: Implement PWM w/ timers
}

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
